Giosuetl/RTOS_stm32f446/STM32_HelloWorld/src/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  Ac6
  * @version V1.0
  * @date    01-December-2013
  * @brief   Default main function.
  ******************************************************************************
*/


#include "stm32f4xx.h"
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <string.h>
#include "task.h"
#include <FreeRTOS.h>
#include <FreeRTOSConfig.h>

//void vApplicationMallocFailedHook( void )
//{
//	/* Called if a call to pvPortMalloc() fails because there is insufficient
//	free memory available in the FreeRTOS heap.  pvPortMalloc() is called
//	internally by FreeRTOS API functions that create tasks, queues, software
//	timers, and semaphores.  The size of the FreeRTOS heap is set by the
//	configTOTAL_HEAP_SIZE configuration constant in FreeRTOSConfig.h. */
//	taskDISABLE_INTERRUPTS();
//        for( ;; );
//}
#define TRUE 1
#define FALSE 0
#define AVAILABLE TRUE
#define NOT_AVAILABLE FALSE
TaskHandle_t xTaskHandle1=NULL;
TaskHandle_t xTaskHandle2=NULL;

void vTask1_handler1(void *params);
void vTask2_handler1(void *params);

//used for semihosting

#ifdef USE_SEMIHOSTING
extern void initialise_monitor_handles();
#endif

static void prvSetupHardware(void);
static void pvrSetupUart(void);
void printmsg(char *msg);
char usr_msg[250];
uint8_t UART_ACCESS_KEY = AVAILABLE;
int main(void)
{
#ifdef USE_SEMIHOSTING
	initialise_monitor_handles();
	printf("Hola mundo ejemplo\n");
#endif

	DWT->CTRL |= (1<<0);// Enable CYCCNT in DWT_CTRL
	//1. Reset the RCC clock configuration to the default reset state.
	//HSI ON, PLL OFF, HSE OFF, system clock = 16MHz, cpu_clock = 16MHz
	RCC_DeInit();

	//2. Update the SystemCoreClock variable
	SystemCoreClockUpdate();
	prvSetupHardware();
	sprintf(usr_msg,"Este es el HOLA MUNDO\r\n");
	printmsg(usr_msg);

	//Start Recording
	SEGGER_SYSVIEW_Conf();
	SEGGER_SYSVIEW_Start();

	//3. Lets create 2 task, task-1 and task-2
	xTaskCreate( vTask1_handler1,"Task-1",configMINIMAL_STACK_SIZE,NULL,2,&xTaskHandle1 );
	xTaskCreate( vTask2_handler1,"Task-2",configMINIMAL_STACK_SIZE,NULL,2,&xTaskHandle1 );

	//4 Start the scheduler
	vTaskStartScheduler();
	for(;;);
}


void vTask1_handler1(void *params)
{
	while(1)
		{
			if(UART_ACCESS_KEY == AVAILABLE)
			{
				UART_ACCESS_KEY= NOT_AVAILABLE;
				printmsg("\nHola mundo desde TASK1\r\n");
				UART_ACCESS_KEY= AVAILABLE;
				SEGGER_SYSVIEW_Print("Task1 is yielding");
				traceISR_EXIT_TO_SCHEDULER();

				taskYIELD();
			}
		}
}
void vTask2_handler1(void *params)
{
	while(1)
	{
		if(UART_ACCESS_KEY == AVAILABLE)
		{
			UART_ACCESS_KEY= NOT_AVAILABLE;
			printmsg("\nHola mundo desde TASK2\r\n");
			UART_ACCESS_KEY= AVAILABLE;
			SEGGER_SYSVIEW_Print("Task2 is yielding");
			traceISR_EXIT_TO_SCHEDULER();

			taskYIELD();
		}
	}
}

static void pvrSetupUart(void)
{
	GPIO_InitTypeDef gpio_uart_pins;
		USART_InitTypeDef uart2_init;
		//1. Enable the UART and GPIOA Peripheral clock

		RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2,ENABLE);
		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA,ENABLE);

		//PA2 is UART2_TX, PA3 is UART2_RX

		//2. Alternate fnction configurations of MCU pins to behave as UART2 TX and RX
		//zeroing each and every member element of the structure
		memset(&gpio_uart_pins,0,sizeof(gpio_uart_pins));
		gpio_uart_pins.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_3;
		gpio_uart_pins.GPIO_Mode = GPIO_Mode_AF;
		gpio_uart_pins.GPIO_PuPd = GPIO_PuPd_UP;

		GPIO_Init(GPIOA, &gpio_uart_pins);

		//3. AF mode settings for the pins
		GPIO_PinAFConfig(GPIOA,GPIO_PinSource2,GPIO_AF_USART2);//PA2
		GPIO_PinAFConfig(GPIOA,GPIO_PinSource3,GPIO_AF_USART2);//PA3

		//4. UART parameter initializations1
		memset(&uart2_init,0,sizeof(uart2_init));
		uart2_init.USART_BaudRate = 115200;
		uart2_init.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
		uart2_init.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
		uart2_init.USART_Parity = USART_Parity_No;
		uart2_init.USART_StopBits = USART_StopBits_1;
		uart2_init.USART_WordLength = USART_WordLength_8b;
		USART_Init(USART2, &uart2_init);
		//5. Enable the UART2 peripheral
		USART_Cmd(USART2,ENABLE);
}

static void prvSetupHardware()
{

	pvrSetupUart();
}

void printmsg(char *msg)
{
	for(uint32_t i =0;i < strlen(msg);i++)
	{
		while(USART_GetFlagStatus(USART2,USART_FLAG_TXE)!= SET);
		USART_SendData(USART2,msg[i]);
	}
}
